= Vim Interface Manual
本ツールは簡単なVim用のインターフェースも備えています。
この文章はその使いかたを解説します。

== インストール
README.jaを見てください。

== 基本
現在使える機能は、以下の通りです。
* ローカル変数/グローバル変数/インスタンス変数/クラス変数/定数の変更
* メソッドとして抽出
* 同名のメソッドをすべてリネーム

また、リファクタリングの対象となるファイルは「カレントバッファのファイルと
同じディレクトリにある *.rb なファイル」と仮定しています。
* Vim に読みこんでいないファイルも変更される
* セーブされていない変更は無視される
ことに注意してください。

それ以外のリファクタリングは、rrbcuiを使ってください。
  :!rrbcui -w *.rb
などとすればカレントディレクトリにあるすべてのスクリプトを対象として
リファクタリングができます。

== リファクタリングのリスト
=== ローカル変数/グローバル変数/インスタンス変数/クラス変数/定数の変更
==== 機能
ローカル変数/グローバル変数/インスタンス変数/クラス変数/定数の名前を
変数のスコープやクラス階層を考慮して変更します。

==== 使いかた
バッファ上の変更をファイルに書き出してから、
変更したい変数の上にカーソルを持っていき、
  :RRBRenameVaraiba foo
としてください。fooは新しい変数名です。

==== 注意
クラス変数、インスタンス変数を変更する場合は、スーパークラスや
サブクラスにも影響があります。

現在のところ、attr_* は一切考慮しません。

=== メソッドとして抽出
==== 機能
指定したコード片を一つのメソッドとして抽出します。

==== 使いかた
バッファ上の変更をファイルに書き出してから、
変更したい部分を「v」で指定して、
  :RRBExtractMethod foo
としてください。fooが新しいメソッドの名前となります。

==== 注意
抽出範囲は行単位で判断されます。

=== 同名のメソッドをすべてリネーム
==== 機能
指定したメソッドと同名のメソッドをすべて別の名前に変更します。

==== 使いかた
バッファ上の変更をファイルに書き出してから、
変更したいメソッドの名前のところにカーソルを持っていって
  :RRBRenameMethodAll foo
としてください。fooが新しいメソッドの名前です。

==== 注意
これはattr_*は考慮しません。
